/*
Создайте 2 числа.
int a = 3;
double b = 2.6;
Запишите сумму этих чисел в одну из переменных путём
неявного преобразования данных.
*/

namespace задание_7
{
    internal class Program
    {
        static void Main(string[] args)
        {
            int a = 3;
            double b = 2.6;
            Console.WriteLine(a + b);
        }
    }
}
