/*
Вывести на одной строке числа 1, 13 и 49 с одним пробелом между ними.
*/

namespace задание_13
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("1 13 49");
        }
    }
}
