/*
Вывести на одной строке числа 7, 15 и 100 с двумя пробелами между ними.
*/

namespace задание_14
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("7  15  100");
        }
    }
}
